<template>
	<div class="xmwrap">
		<div class="header">
			<Header :title="'流浪地球 · 刹车时代'"></Header>
		</div>
		<div class="article">
			<Article :amend="peizhi">
				<div id="CntArticle">
					<p>小星老师从随身带来的一个小箱子中小心翼翼地拿出了那个玻璃球，死去的小虾漂浮在水面上，水已混浊不堪，腐烂的藻类植物已失去了绿色，变成一团没有生命的毛状物覆盖在珊瑚上。</p>
					<p>“这个小世界死了。孩子们，谁能说出为什么？”小星老师把那个死亡的世界举到孩子们面前。</p>
					<p>“它太小了！”</p>
					<p>“说得对，太小了，小的生态系统，不管多么精确，是经不起时间的风浪的。</p>
					<p>飞船派们想像中的飞船也一样。”</p>
					<p>“我们的飞船可以造得像上海或纽约那么大。”阿东说，声音比刚才低了许多。</p>
					<p>“是的，按人类目前的技术也只能造这么大，同地球相比，这样的生态系统还是太小了，太小了。”</p>
					<p>“我们会找到新的行星。”</p>
					<p>“这连你们自己也不相信。半人马座没有行星，最近的有行星的恒星在八百五十光年以外，目前人类能建造的最快的飞船也只能达到光速的百分之零点五，这样就需十七万年时间才能到那儿，飞船规模的生态系统连这十分之一的时间都维持不了。孩子们，只有像地球这样规模的生态系统，这样气势磅礴的生态循环，才能使生命万代不息！人类在宇宙间离开了地球，就像婴儿在沙漠里离开了母亲！”</p>
					<p>“可……老师，我们来不及的，地球来不及的，它还来不及加速到足够快，航行到足够远，太阳就爆炸了！”</p>
					<p>“时间是够的，要相信联合政府！这我说了多少遍，如果你们还不相信，我们就退一万步说：人类将自豪地去死，因为我们尽了最大的努力！”</p> <br>

					<p>人类的逃亡分为五步：第一步，用地球发动机使地球停止转动，使发动机喷口固定在地球运行的反方向；第二步，全功率开动地球发动机，使地球加速到逃逸速度，飞出太阳系；第三步，在外太空继续加速，飞向比邻星；第四步，在中途使地球重新自转，掉转发动机方向，开始减速；第五步，地球泊入比邻星轨道，成为这颗恒星的卫星。人们把这五步分别称为刹车时代、逃逸时代、流浪时代Ⅰ(加速)、流浪时代Ⅱ(减速)、新太阳时代。</p>
					<p>整个移民过程将延续两千五百年时间，一百代人。</p> <br>

					<p>我们的船继续航行，到了地球黑夜的部分，在这里，阳光和地球发动机的光柱都照不到，在大西洋清凉的海风中，我们这些孩子第一次看到了星空。天啊，那是怎样的景象啊，美得让我们心醉。小星老师一手搂着我们，一手指着星空，看，孩子们，那就是半人马座，那就是比邻星，那就是我们的新家！说完她哭了起来，我们也都跟着哭了，周围的水手和船长，这些铁打的汉子也流下了眼泪。所有的人都用泪眼探望着老师指的方向，星空在泪水中扭曲抖动，惟有那个星星是不动的，那是黑夜大海狂浪中远方陆地的灯塔，那是冰雪荒原中快要冻死的孤独旅人前方隐现的火光，那是我们心中的太阳，是人类在未来一百代人的苦海中惟一的希望和支撑……</p> <br>
					
					<p>在回家的航程中，我们看到了启航的第一个信号：夜空中出现了一个巨大的彗星，那是月球。人类带不走月球，就在月球上也安装了行星发动机，把它推离地球轨道，以免在地球加速时相撞。月球上行星发动机产生的巨大彗尾使大海笼罩在一片蓝光之中，群星看不见了。月球移动产生的引力潮汐使大海巨浪冲天，我们改乘飞机向南半球的家飞去。</p>
					<p>启航的日子终于到了！</p>
					<p>我们一下飞机，就被地球发动机的光柱照得睁不开眼，这些光柱比以前亮了几倍，而且所有光柱都由倾斜变成笔直。地球发动机开到了最大功率，加速产生的百米巨浪轰鸣着滚上每个大陆，灼热的飓风夹着滚烫的水沫，在林立的顶天立地的等离子光柱间疯狂呼啸，拔起了陆地上所有的大树……这时从宇宙空间看，我们的星球也成了一个巨大的彗星，蓝色的彗尾刺破了黑暗的太空。</p>
					<p>地球上路了，人类上路了。</p>
					<p>就在启航时，爷爷去世了，他身上的烫伤已经感染。弥留之际他反复念叨着一句话：“啊，地球，我的流浪地球啊……”</p>
				</div>
			</Article>
		</div>
	</div>
</template>

<script>
import Article from '@/components/plug/swiper/article'
import Header from '@/components/common/header'

export default {
	data () {
		return {
			peizhi: {
				scrollbar: {}
			}
		}
	},
	components: { Article, Header }
}
</script>

<style scoped>
.header {
	flex: 0 0 36px;
}
.article {
	width: 100%;
	position: relative;
	height: calc(100% - 36px);
	flex: 1 1 auto;
	padding: 10px 0;
	box-sizing: border-box;
	background-color: papayawhip;
}
#CntArticle {
	padding: 0 20px;
	box-sizing: border-box;
	font-size: 18px;
	line-height: 1.6;
	font-family: 'Source Han Sans CN';
	text-indent: 2em;
	/* text-shadow: 0 1px 2px #000; */
}
#CntArticle p {
	margin-bottom: 14px;
}
.vuewrap header {
	background-color: papayawhip;
}
</style>