<template>
	<div class="main">
		通过滑动浏览一段文字
		<Article>
			<div id="CntArticle">
				<h4>播种</h4>
				<p>琳达上幼儿园的时候，望远镜和探测器拍到了第一批模糊的图像，图像呈现的是围绕遥远恒星运行的行星。</p>
				<p>她用粗线条和明亮色画那些行星，自己身着粉色宇航服的形象行走于三轮红日之下。她还画穹庐城市和天空中带着光环的月亮，以及紫色丛林，那里的叶子是五角形，鸟儿有四只翅膀。</p>
				<p>她画宇宙飞船，她在宇宙飞船里望着窗外，在飞船的后边她还画了明亮的红色火焰。</p>
				<p>“可不是那样！”建造航天飞机的父亲笑着说，“乘坐化学燃料火箭，你可到不了那些星星。我们现在还没掌握让你飞到那里的技术，不过也许你会发明出来呢。”</p>
				<p>她画自己漂浮在群星之间，还给行星起名字。</p>
				<p>“幸福世界、冰球、大泡泡……”</p>
				<p>“你要抛下我们到那些行星上生活吗？”她父亲逗弄着她。</p>
				<p>“你们可以来看我啊。”她非常严肃地说。</p>
				<br />
				<p>十岁的时候，父亲送给她一架望远镜。他俩把望远镜安装在后院，一起观察那些已经被发现具有行星的恒星：格利泽581、巨蟹座55、仙女座Υ星……</p>
				<p>“要是我在太空迷路了该怎么办？”琳达问，“我该怎么找到去其他星球的路？”</p>
				<p>她父亲考虑了一下，人们似乎没有兴趣支持如何离开地球的研究工作，所以琳达的问题就显得微不足道。他只是为琳达指了指室女星座，并没有表现出扫兴的疑虑。</p>
				<p>“看见那颗亮星了吗？那是室女座α星，我们所见最亮的星星之一。从它开始，向南偏西一点儿就是室女座61，距我们27.8光年，拥有首批被发现的系外行星。有室女α星指引，你就不会迷路了。”</p>
				<p>琳达在大学是班上唯一的航空航天专业的学生。大家都在潜心解决这个星球上的问题：如何让穷人温饱、如何赚钱、如何让驾驶汽车更经济。</p>
				<p>太空没有未来，政府和商业机构在这一点上达成了共识，所以对太空的探索工作停滞不前。只有一座空间站还运行在地球低轨道上。</p>
				<p>跟琳达的梦想相比，现实如此苍 白。不过，她还是想进入太空。</p>
				<br />
				<p>此刻，在空间站里，琳达正漂浮在一片漆黑的东海岸上空几百公里高的地方。</p>
				<p>“有人吗？”她对着麦克风说，“请回答，如果你能听见请回答。”</p>
				<p>没有回答，只有噪声，比太阳耀斑引起的还嘈杂。</p>
				<p>时至深夜，她仔细寻找下边陆地上的灯光，一点也没有，导弹和炸弹完成了使命。它们的设计是那样精细，甚至远胜过这座古老的空间站。</p>
				<p>她看到第一枚导弹击中目标的时候错愕不已，从波士顿到迈阿密的海岸线消失在一连串无声的蘑菇云中，仿佛好些个蛋奶酥在不断地膨胀。同样的景象在地球的其他地方重复着，不管是疯子、母亲、百万富翁，还是移民工人，数十亿生命瞬间蒸发。</p>
				<p>一遍又一遍，她想象着父母、朋友和曾经的爱人们临终的情形，难以自拔。</p>
				<p>空间站上的食物和空气足够她再支撑一年。要是她谨慎使用的话，也许能用上两年。然而不会再有补给，空间站就是她的坟墓。</p>
				<p>“请问有人能听见吗？请回答。”她的声音沮丧而又单调。重复多遍的话语连自己听起来都感到陌生，甚至有时候听上去和噪声没有分别。</p>
				<p>在下方旋转的地球背景上，不断后退的空间站已经渺小得难以分辨。“再见。”她低声说。</p>
				<p>琳达小心地操纵宇航服推进器，把前进的方向对准室女星座。她的目标是室女座α星，然后向西南调整几度，就能到达室女座61。</p>
				<p>有科学家相信地球生命起源于别处，他们认为孢子或有机物片段乘坐流星、小行星或宇宙尘埃来到地球，在古地球的原始海洋中播下生命的种子。如此质朴的开端造就了生命之树的繁荣和发展，这就是“胚种假说理论”。</p>
				<p>反过来说，为什么地球生命不能向其他世界播撒生命的种子呢？</p>
				<p>不到20分钟，推进器就会把燃料用尽，她能加速到逃逸速度吗？依靠惯性一直滑行，假如她真能到达室女座61，那也要很久很久的时间，几十万年。</p>
				<p>她抛开疑虑，到达那里的几率微乎其微，但肯定不会小于生命在这座宇宙诞生的几率。</p>
				<p>宇航服里的空气只能再维持10个小时左右，但是生命的最后关头不是她要考虑的，到达室女座61的情形一直萦绕在她的心头。</p>
				<p>新行星的重力会捕获她，将她拉向地表。那里会有温暖的海洋、云、雾和雨。她的宇航服会打开，里边是珍贵的合成蛋白质、粉末状有机化合物片段、她的遗体残骸和携带的所有微生物。</p>
				<p>播下生命的种子以后，分子开始自我组织和复制，形成更加复杂的合成结构。再过一亿年，那里会出现紫色丛林吗？会有五角形叶子和四只翅膀的鸟儿吗？会有自认为是人类的生物建造的穹庐城市吗？</p>
				<p>她不会迷路。</p>
				<p>“爸爸，我终于做到了。”她说。</p>
				<p>她把推进力开到最大，奔向群星。</p>
			</div>
		</Article>
	</div>
</template>

<script>
import Article from '@/components/plug/swiper/article'

export default {
	data () {
		return {}
	},
	components: { Article }
}
</script>

<style scoped>
.main {
	height: 100%;
	padding: 20px;
	box-sizing: border-box;
	background-color: teal;
}
#CntArticle {
	font-size: 18px;
	line-height: 1.6;
	font-family: 'Source Han Sans CN';
	text-indent: 2em;
	/* text-shadow: 0 1px 2px #000; */
	color: #000;
	cursor: grab;
}
#CntArticle p {
	margin-bottom: 8px;
}
</style>